PureDarwin/PureDarwin/src/Kernel/xnu/bsd/man/man2/chown.2
.\" Copyright (c) 1980, 1991, 1993, 1994
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" Redistribution and use in source and binary forms, with or without
.\" modification, are permitted provided that the following conditions
.\" are met:
.\" 1. Redistributions of source code must retain the above copyright
.\"    notice, this list of conditions and the following disclaimer.
.\" 2. Redistributions in binary form must reproduce the above copyright
.\"    notice, this list of conditions and the following disclaimer in the
.\"    documentation and/or other materials provided with the distribution.
.\" 3. All advertising materials mentioning features or use of this software
.\"    must display the following acknowledgement:
.\"	This product includes software developed by the University of
.\"	California, Berkeley and its contributors.
.\" 4. Neither the name of the University nor the names of its contributors
.\"    may be used to endorse or promote products derived from this software
.\"    without specific prior written permission.
.\"
.\" THIS SOFTWARE IS PROVIDED BY THE REGENTS AND CONTRIBUTORS ``AS IS'' AND
.\" ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
.\" IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
.\" ARE DISCLAIMED.  IN NO EVENT SHALL THE REGENTS OR CONTRIBUTORS BE LIABLE
.\" FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
.\" DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
.\" OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
.\" HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
.\" LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY
.\" OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF
.\" SUCH DAMAGE.
.\"
.\"     @(#)chown.2	8.4 (Berkeley) 4/19/94
.\"
.Dd April 19, 1994
.Dt CHOWN 2
.Os
.Sh NAME
.Nm chown ,
.Nm fchown ,
.Nm lchown ,
.Nm fchownat
.Nd change owner and group of a file
.Sh SYNOPSIS
.In unistd.h
.Ft int
.Fo chown
.Fa "const char *path"
.Fa "uid_t owner"
.Fa "gid_t group"
.Fc
.Ft int
.Fo fchown
.Fa "int fildes"
.Fa "uid_t owner"
.Fa "gid_t group"
.Fc
.Ft int
.Fo lchown
.Fa "const char *path"
.Fa "uid_t owner"
.Fa "gid_t group"
.Fc
.Ft int
.Fn fchownat "int fd" "const char *path" "uid_t owner" "gid_t group" "int flag"
.Sh DESCRIPTION
The owner ID and group ID of the file
named by
.Fa path
or referenced by
.Fa fildes
is changed as specified by the arguments
.Fa owner
and
.Fa group .
The owner of a file may change the
.Fa group
to a group of which
he or she is a member,
but the change
.Fa owner
capability is restricted to the super-user.
.Pp
The
.Fn chown
system call clears the set-user-id and set-group-id bits on the file.
The
.Fn chown
system call
follows symbolic links to operate on the target of the link
rather than the link itself.
.Pp
The
.Fn fchown
system call
is particularly useful when used in conjunction
with the file locking primitives (see
.Xr flock 2 ) .
.Pp
The
.Fn lchown
system call is similar to
.Fn chown
but does not follow symbolic links.
.Pp
The
.Fn fchownat
system call is equivalent to the
.Fn chown
and
.Fn lchown
except in the case where
.Fa path
specifies a relative path.
In this case the file to be changed is determined relative to the directory
associated with the file descriptor
.Fa fd
instead of the current working directory.
.Pp
Values for
.Fa flag
are constructed by a bitwise-inclusive OR of flags from the following
list, defined in
.In fcntl.h :
.Bl -tag -width AT_SYMLINK_NOFOLLOW_ANY
.It Dv AT_SYMLINK_NOFOLLOW
If
.Fa path
names a symbolic link, ownership of the symbolic link is changed.
.El
.Bl -tag -width AT_SYMLINK_NOFOLLOW_ANY
.It Dv AT_SYMLINK_NOFOLLOW_ANY
If
.Fa path
names a symbolic link, ownership of the symbolic link is changed.
If any any other symbolic link is encountered it is not followed
and an error is returned instead.
.El
.Bl -tag -width AT_SYMLINK_NOFOLLOW_ANY
.It Dv AT_RESOLVE_BENEATH
If
.Fa path
does not reside in the hierarchy beneath the starting directory,
an error is returned.
.El
.Bl -tag -width AT_SYMLINK_NOFOLLOW_ANY
.It Dv AT_UNIQUE
If
.Fa path
resolves to a vnode with multiple hard links,
an error is returned.
.El
.Pp
If
.Fn fchownat
is passed the special value
.Dv AT_FDCWD
in the
.Fa fd
parameter, the current working directory is used and the behavior is identical
to a call to
.Fn chown
or
.Fn lchown
respectively, depending on whether or not the
.Dv AT_SYMLINK_NOFOLLOW
bit is set in the
.Fa flag
argument.
.Pp
One of the owner or group id's
may be left unchanged by specifying it as -1.
.Sh RETURN VALUES
.Rv -std
.Sh ERRORS
.Pp
The
.Fn chown
and
.Fn lchown
system calls will fail if:
.Bl -tag -width Er
.\" ==========
.It Bq Er EACCES
Search permission is denied for a component of the path prefix.
.It Bq Er EFAULT
The
.Fa path
argument
points outside the process's allocated address space.
.\" ==========
.It Bq Er ELOOP
Too many symbolic links are encountered in translating the pathname.
This is taken to be indicative of a looping symbolic link.
.\" ==========
.It Bq Er ELOOP
If AT_SYMLINK_NOFOLLOW_ANY is passed a symbolic link was encountered
in translating the pathname.
.\" ==========
.It Bq Er ENAMETOOLONG
A component of a pathname exceeded 255 characters,
or an entire path name exceeded 1023 characters.
.\" ==========
.It Bq Er ENOENT
A component of
.Fa path
does not exist.
.\" ==========
.It Bq Er ENOTDIR
A component of the path prefix is not a directory.
.El
.Pp
The
.Fn fchown
system call will fail if:
.Bl -tag -width Er
.\" ==========
.It Bq Er EBADF
The
.Fa fildes
argument
does not refer to a valid descriptor.
.\" ==========
.It Bq Er EINVAL
The
.Fa fildes
argument
refers to a socket, not a file.
.El
.Pp
Any of these calls will fail if:
.Bl -tag -width Er
.\" ==========
.It Bq Er EINTR
Its execution is interrupted by a signal.
.\" ==========
.It Bq Er EIO
An I/O error occurs while reading from or writing to the file system.
.\" ==========
.It Bq Er EPERM
The effective user ID does not match the owner of the file
and the calling process does not have appropriate (i.e., root) privileges.
.\" ==========
.It Bq Er EROFS
The named file resides on a read-only file system.
.El
.Pp
In addition to the errors specified for
.Fn chown
and
.Fn lchown ,
the
.Fn fchownat
system call may fail if:
.Bl -tag -width Er
.It Bq Er EBADF
The
.Fa path
argument does not specify an absolute path and the
.Fa fd
argument is neither
.Dv AT_FDCWD
nor a valid file descriptor open for searching.
.It Bq Er EINVAL
The value of the
.Fa flag
argument is not valid.
.It Bq Er ENOTDIR
The
.Fa path
argument is not an absolute path and
.Fa fd
is neither
.Dv AT_FDCWD
nor a file descriptor associated with a directory.
.It Bq Er ENOTCAPABLE
if AT_RESOLVE_BENEATH was passed and
.Fa path
does not reside in the directory hierarchy beneath the starting directory.
.It Bq Er ENOTCAPABLE
if AT_UNIQUE was passed and
.Fa path
resolves to a vnode with multiple links.
.El
.Sh SEE ALSO
.Xr chgrp 1 ,
.Xr chmod 2 ,
.Xr flock 2 ,
.Xr chown 8
.Sh STANDARDS
The
.Fn chown
system call is expected to conform to
.St -p1003.1-90 .
The
.Fn fchownat
system call is expected to conform to POSIX.1-2008 .
.Sh HISTORY
The
.Fn chown
function appeared in
.At v7 .
The
.Fn fchown
system call appeared in
.Bx 4.2 .
.Pp
The
.Fn chown
and
.Fn fchown
system calls were changed to follow symbolic links in
.Bx 4.4 .
The
.Fn lchown
system call was added in
.Fx 3.0
to compensate for the loss of functionality.
.Pp
The
.Fn fchownat
system call appeared in OS X 10.10
